# Самостоятельное задание 1 (+1 балл к оценке за курс).

In [1]:
import pandas as pd

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [18]:
df = pd.DataFrame()

for i in range(10):
    marks_path = f'data/students_marks_{i}.csv'
    info_path = f'data/students_info_{i}.csv'
    marks = pd.read_csv(marks_path)
    info = pd.read_csv(info_path)
    marks_and_info = pd.merge(marks, info, on='index')
    df = pd.concat([df, marks_and_info])
    
df.head()

,index,math score,reading score,writing score,gender,race/ethnicity,parental level of education,lunch,test preparation course,group
0,0,72,72,74,female,group B,bachelor's degree,standard,none,group1
1,1,69,90,88,female,group C,some college,standard,completed,group1
2,2,90,95,93,female,group B,master's degree,standard,none,group1
3,3,47,57,44,male,group A,associate's degree,free/reduced,none,group1
4,4,76,78,75,male,group C,some college,standard,none,group1

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [20]:
df = df.drop('index', axis=1)
df.head(10)

,math score,reading score,writing score,gender,race/ethnicity,parental level of education,lunch,test preparation course,group
0,72,72,74,female,group B,bachelor's degree,standard,none,group1
1,69,90,88,female,group C,some college,standard,completed,group1
2,90,95,93,female,group B,master's degree,standard,none,group1
3,47,57,44,male,group A,associate's degree,free/reduced,none,group1
4,76,78,75,male,group C,some college,standard,none,group1
5,71,83,78,female,group B,associate's degree,standard,none,group1
6,88,95,92,female,group B,some college,standard,completed,group1
7,40,43,39,male,group B,some college,free/reduced,none,group1
8,64,64,67,male,group D,high school,free/reduced,completed,group1
9,38,60,50,female,group B,high school,free/reduced,none,group1

#### Задание 3. Выведите на экран размеры полученной таблицы

In [21]:
df.shape

(1000, 9)

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [24]:
columns = ['reading score', 'writing score', 'math score']

new_df = df[columns]

In [25]:
new_df.min()

reading score    17
writing score    10
math score        0
dtype: int64

In [26]:
new_df.max()

reading score    100
writing score    100
math score       100
dtype: int64

In [27]:
new_df.mean()

reading score    69.169
writing score    68.054
math score       66.089
dtype: float64

In [28]:
new_df.std()

reading score    14.600192
writing score    15.195657
math score       15.163080
dtype: float64

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

In [42]:
df.isnull().values.any()

False

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [45]:
new_df.mean()

reading score    69.169
writing score    68.054
math score       66.089
dtype: float64

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [61]:
columns = ['reading score', 'writing score', 'math score', 'test preparation course']
new_df = df[columns]
new_df.groupby('test preparation course').mean()

                         reading score  writing score  math score
test preparation course
completed                    73.893855      74.418994   69.695531
none                         66.534268      64.504673   64.077882

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [55]:
df['lunch'].unique()

array(['standard', 'free/reduced'], dtype=object)

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [64]:
df = df.rename(columns={'parental level of education': 'education', 'test preparation course': 'test preparation'})
df.head()

,math score,reading score,writing score,gender,race/ethnicity,education,lunch,test preparation,group
0,72,72,74,female,group B,bachelor's degree,standard,none,group1
1,69,90,88,female,group C,some college,standard,completed,group1
2,90,95,93,female,group B,master's degree,standard,none,group1
3,47,57,44,male,group A,associate's degree,free/reduced,none,group1
4,76,78,75,male,group C,some college,standard,none,group1

**Зафиксируем минимальный балл для сдачи экзамена**

In [65]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark > 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [67]:
df.shape

(1000, 9)

In [68]:
df[df['math score'] > passmark].shape[0] / df.shape[0]

0.85

In [70]:
df[(df['math score'] > passmark) & (df['test preparation'] == 'completed')].shape[0] / df[df['test preparation'] == 'completed'].shape[0]

0.9078212290502793

In [72]:
df[(df['math score'] < passmark) & (df['gender'] == 'male') & (df['test preparation'] == 'none')].shape[0] / df[(df['gender'] == 'male') & (df['test preparation'] == 'none')].shape[0]

0.12012987012987013

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [75]:
%time df[['race/ethnicity', 'reading score']].groupby('race/ethnicity').mean()

CPU times: user 1.78 ms, sys: 2.39 ms, total: 4.17 ms
Wall time: 3.47 ms

                reading score
race/ethnicity
group A             64.674157
group B             67.352632
group C             69.103448
group D             70.030534
group E             73.028571

In [85]:
%time df[['education', 'writing score']].groupby('education').min().sort_values('writing score', ascending=False, kind='stable')

CPU times: user 2 ms, sys: 3.76 ms, total: 5.76 ms
Wall time: 5.64 ms

                    writing score
education
master's degree                46
bachelor's degree              38
associate's degree             35
some college                   19
high school                    15
some high school               10

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [ ]:
# your code here

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [ ]:
# your code here

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [ ]:
# your code here

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [ ]:
# your code here

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####      90 и больше = A
####      80-89 = B
####      70-79 = C
####      60-69 = D
####      50-59 = E
####    меньше 50 = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

In [ ]:
def GetGrade(average_mark):
    # your code here    

# your code here